# **16. 이름에 el이 들어가는 동물 찾기(250131)(String, Date)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 보호소에 돌아가신 할머니가 기르던 개를 찾는 사람이 찾아왔습니다.
# 이 사람이 말하길 할머니가 기르던 개는 이름에 'el'이 들어간다고 합니다.
# 동물 보호소에 들어온 동물 이름 중, 이름에 "EL"이 들어가는 개의 아이디와 이름을 조회하는 SQL문을 작성해주세요.
# 이때 결과는 이름 순으로 조회해주세요. 단, 이름의 대소문자는 구분하지 않습니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A355753	Dog	2015-09-10 13:14:00	Normal	Elijah	Neutered Male
# A352872	Dog	2015-07-09 17:51:00	Aged	Peanutbutter	Neutered Male
# A353259	Dog	2016-05-08 12:57:00	Injured	Bj	Neutered Male
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A382192	Dog	2015-03-13 13:14:00	Normal	Maxwell 2	Intact Male
# 이름에 'el'이 들어가는 동물은 Elijah, Ella, Maxwell 2입니다.
# 이 중, 개는 Elijah, Maxwell 2입니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A355753	Elijah
# A382192	Maxwell 2

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# WHERE NAME LIKE '%el%' AND ANIMAL_TYPE = 'Dog'
# ORDER BY NAME

# **17. NULL 처리하기(250201)(IS NULL)**(오답)

1) IFNULL

In [ ]:
# SELECT ANIMAL_TYPE,  -- 동물의 생물 종을 선택
#        IFNULL(NAME, 'No name') AS NAME,  -- NAME이 NULL이면 'No name'으로 표시, 아니면 기존 값 유지
#        SEX_UPON_INTAKE  -- 성별 및 중성화 여부 선택
# FROM ANIMAL_INS  -- ANIMAL_INS 테이블에서 조회
# ORDER BY ANIMAL_ID;  -- ANIMAL_ID 기준으로 오름차순 정렬

In [ ]:
# 설명
# 1. SELECT ANIMAL_TYPE
#  - ANIMAL_TYPE 컬럼을 선택하여 동물의 종(예: 개, 고양이 등)을 가져옵니다.

# 2. IFNULL(NAME, 'No name') AS NAME
#  - NAME 컬럼이 NULL이면 "No name"으로 변경하고, 그렇지 않으면 기존 NAME 값을 유지합니다.
#  - IFNULL(column, 대체값)은 MySQL에서 제공하는 함수로, column 값이 NULL이면 대체값을 반환합니다.
#  - 결과적으로, 보호소에 들어올 때 이름이 없는 동물은 "No name"으로 표시됩니다.

2) CASE WHEN

In [ ]:
# SELECT ANIMAL_TYPE,  -- 동물의 생물 종을 선택
#        CASE WHEN NAME IS NULL THEN 'No name' ELSE NAME END AS NAME,  -- NAME이 NULL이면 'No name', 그렇지 않으면 원래 값 유지
#        SEX_UPON_INTAKE  -- 성별 및 중성화 여부 선택
# FROM ANIMAL_INS  -- ANIMAL_INS 테이블에서 조회
# ORDER BY ANIMAL_ID;  -- ANIMAL_ID 기준으로 오름차순 정렬

In [ ]:
# 설명

# 1. SELECT ANIMAL_TYPE
#  - 동물의 생물 종(개, 고양이 등)을 조회합니다.

# 2. CASE WHEN NAME IS NULL THEN 'No name' ELSE NAME END AS NAME
#  - CASE 문을 사용하여 NAME 값이 NULL인지 확인합니다.
#  - WHEN NAME IS NULL THEN 'No name' → NAME 값이 NULL이면 "No name"으로 변경합니다.
#  - ELSE NAME → 그렇지 않으면 기존 NAME 값을 그대로 유지합니다.
#  - END → CASE 문을 종료합니다.
#  - 결과적으로 NULL 값을 "No name"으로 변환하여 출력합니다.

# **18. DATETIME에서 DATE로 형 변환(250205)(String, Date)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# ANIMAL_INS 테이블에 등록된 모든 레코드에 대해,

# 각 동물의 아이디와 이름, 들어온 날짜1를 조회하는 SQL문을 작성해주세요. 이때 결과는 아이디 순으로 조회해야 합니다.

# 예시
# 예를 들어, ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_INS

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A349996	Cat	2018-01-22 14:32:00	Normal	Sugar	Neutered Male
# A350276	Cat	2017-08-13 13:50:00	Normal	Jewel	Spayed Female
# A350375	Cat	2017-03-06 15:01:00	Normal	Meo	Neutered Male
# A352555	Dog	2014-08-08 04:20:00	Normal	Harley	Spayed Female
# A352713	Cat	2017-04-13 16:29:00	Normal	Gia	Spayed Female
# SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	날짜
# A349996	Sugar	2018-01-22
# A350276	Jewel	2017-08-13
# A350375	Meo	2017-03-06
# A352555	Harley	2014-08-08
# A352713	Gia	2017-04-13

In [ ]:
# SELECT ANIMAL_ID, NAME, DATE_FORMAT(DATETIME, '%Y-%m-%d') AS 날짜
# FROM ANIMAL_INS
# ORDER BY ANIMAL_ID;

In [ ]:
# SELECT ANIMAL_ID, NAME, DATE(DATETIME) AS 날짜
# FROM ANIMAL_INS
# ORDER BY ANIMAL_ID;

# **19. 경기도에 위치한 식품창고 목록 출력하기(250206)(IS NULL)**

In [ ]:
# SELECT WAREHOUSE_ID, WAREHOUSE_NAME, ADDRESS, IFNULL(FREEZER_YN, 'N') AS FREEZER_YN
# FROM FOOD_WAREHOUSE
# WHERE ADDRESS LIKE '경기도%'
# ORDER BY WAREHOUSE_ID;